spec/fixtures/express_checkout/checkout/pay/sales/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=93.0&TOKEN=EC-4NT45905PP4254419&method=GetExpressCheckoutDetails
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Thu, 18 Apr 2013 05:16:51 GMT
      Server: 
      - Apache
      Content-Length: 
      - "1293"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TOKEN=EC%2d4NT45905PP4254419&CHECKOUTSTATUS=PaymentActionNotInitiated&TIMESTAMP=2013%2d04%2d18T05%3a16%3a51Z&CORRELATIONID=f6d38b415aa17&ACK=Success&VERSION=93%2e0&BUILD=5691908&EMAIL=tcbuyer%40dynosoft%2ecom&PAYERID=TBB6QXVMP4VM2&PAYERSTATUS=verified&FIRSTNAME=Darius&LASTNAME=Wang&COUNTRYCODE=US&SHIPTONAME=Darius%20Wang&SHIPTOSTREET=1%20Main%20St&SHIPTOCITY=San%20Jose&SHIPTOSTATE=CA&SHIPTOZIP=95131&SHIPTOCOUNTRYCODE=US&SHIPTOCOUNTRYNAME=United%20States&ADDRESSSTATUS=Confirmed&CURRENCYCODE=USD&AMT=20%2e00&SHIPPINGAMT=0%2e00&HANDLINGAMT=0%2e00&TAXAMT=0%2e00&DESC=Awesome%20Shop&INSURANCEAMT=0%2e00&SHIPDISCAMT=0%2e00&PAYMENTREQUEST_0_CURRENCYCODE=USD&PAYMENTREQUEST_0_AMT=20%2e00&PAYMENTREQUEST_0_SHIPPINGAMT=0%2e00&PAYMENTREQUEST_0_HANDLINGAMT=0%2e00&PAYMENTREQUEST_0_TAXAMT=0%2e00&PAYMENTREQUEST_0_DESC=Awesome%20Shop&PAYMENTREQUEST_0_INSURANCEAMT=0%2e00&PAYMENTREQUEST_0_SHIPDISCAMT=0%2e00&PAYMENTREQUEST_0_INSURANCEOPTIONOFFERED=false&PAYMENTREQUEST_0_SHIPTONAME=Darius%20Wang&PAYMENTREQUEST_0_SHIPTOSTREET=1%20Main%20St&PAYMENTREQUEST_0_SHIPTOCITY=San%20Jose&PAYMENTREQUEST_0_SHIPTOSTATE=CA&PAYMENTREQUEST_0_SHIPTOZIP=95131&PAYMENTREQUEST_0_SHIPTOCOUNTRYCODE=US&PAYMENTREQUEST_0_SHIPTOCOUNTRYNAME=United%20States&PAYMENTREQUEST_0_ADDRESSSTATUS=Confirmed&PAYMENTREQUESTINFO_0_ERRORCODE=0
    http_version: 
  recorded_at: Thu, 18 Apr 2013 05:16:51 GMT
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=93.0&TOKEN=EC-4NT45905PP4254419&PAYERID=TBB6QXVMP4VM2&PAYMENTREQUEST_0_DESC=Awesome+Shop&PAYMENTREQUEST_0_PAYMENTACTION=Sale&PAYMENTREQUEST_0_AMT=20.00&PAYMENTREQUEST_0_CURRENCYCODE=USD&method=DoExpressCheckoutPayment
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Thu, 18 Apr 2013 05:16:52 GMT
      Server: 
      - Apache
      Content-Length: 
      - "867"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TOKEN=EC%2d4NT45905PP4254419&SUCCESSPAGEREDIRECTREQUESTED=false&TIMESTAMP=2013%2d04%2d18T05%3a16%3a54Z&CORRELATIONID=c0aea9be9d9f0&ACK=Success&VERSION=93%2e0&BUILD=5691908&INSURANCEOPTIONSELECTED=false&SHIPPINGOPTIONISDEFAULT=false&PAYMENTINFO_0_TRANSACTIONID=5FB43780YM066633W&PAYMENTINFO_0_TRANSACTIONTYPE=expresscheckout&PAYMENTINFO_0_PAYMENTTYPE=instant&PAYMENTINFO_0_ORDERTIME=2013%2d04%2d18T05%3a16%3a53Z&PAYMENTINFO_0_AMT=20%2e00&PAYMENTINFO_0_FEEAMT=0%2e88&PAYMENTINFO_0_TAXAMT=0%2e00&PAYMENTINFO_0_CURRENCYCODE=USD&PAYMENTINFO_0_PAYMENTSTATUS=Completed&PAYMENTINFO_0_PENDINGREASON=None&PAYMENTINFO_0_REASONCODE=None&PAYMENTINFO_0_PROTECTIONELIGIBILITY=Eligible&PAYMENTINFO_0_PROTECTIONELIGIBILITYTYPE=ItemNotReceivedEligible%2cUnauthorizedPaymentEligible&PAYMENTINFO_0_SECUREMERCHANTACCOUNTID=GCK9DAQBWTUHQ&PAYMENTINFO_0_ERRORCODE=0&PAYMENTINFO_0_ACK=Success
    http_version: 
  recorded_at: Thu, 18 Apr 2013 05:16:54 GMT
recorded_with: VCR 2.3.0
