spec/fixtures/express_checkout/checkout/pay/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=72.0&TOKEN=EC-66R94860GU0469430&method=GetExpressCheckoutDetails
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Thu, 21 Mar 2013 03:44:36 GMT
      Server: 
      - Apache
      Content-Length: 
      - "1432"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TOKEN=EC%2d66R94860GU0469430&CHECKOUTSTATUS=PaymentActionNotInitiated&TIMESTAMP=2013%2d03%2d21T03%3a44%3a36Z&CORRELATIONID=516d1b4626e9b&ACK=Success&VERSION=72%2e0&BUILD=5479129&EMAIL=chardy_1345003165_per%40gmail%2com&PAYERID=4YLKLC48QZJ6Y&PAYERSTATUS=unverified&FIRSTNAME=Chardy&LASTNAME=Wang&COUNTRYCODE=US&SHIPTONAME=Chardy%Wang&SHIPTOSTREET=1%20Main%20St&SHIPTOCITY=San%20Jose&SHIPTOSTATE=CA&SHIPTOZIP=95131&SHIPTOCOUNTRYCODE=US&SHIPTOCOUNTRYNAME=United%20States&ADDRESSSTATUS=Confirmed&CURRENCYCODE=USD&AMT=1300%2e00&SHIPPINGAMT=0%2e00&HANDLINGAMT=0%2e00&TAXAMT=0%2e00&DESC=MacBook%20Air&NOTIFYURL=http%3a%2f%2fexample%2ecom%2fpaypal%2fipn&INSURANCEAMT=0%2e00&SHIPDISCAMT=0%2e00&PAYMENTREQUEST_0_CURRENCYCODE=USD&PAYMENTREQUEST_0_AMT=1300%2e00&PAYMENTREQUEST_0_SHIPPINGAMT=0%2e00&PAYMENTREQUEST_0_HANDLINGAMT=0%2e00&PAYMENTREQUEST_0_TAXAMT=0%2e00&PAYMENTREQUEST_0_DESC=MacBook%20Air&PAYMENTREQUEST_0_NOTIFYURL=http%3a%2f%2fexample%2ecom%2fpaypal%2fipn&PAYMENTREQUEST_0_INSURANCEAMT=0%2e00&PAYMENTREQUEST_0_SHIPDISCAMT=0%2e00&PAYMENTREQUEST_0_INSURANCEOPTIONOFFERED=false&PAYMENTREQUEST_0_SHIPTONAME=Chardy%Wang&PAYMENTREQUEST_0_SHIPTOSTREET=1%20Main%20St&PAYMENTREQUEST_0_SHIPTOCITY=San%20Jose&PAYMENTREQUEST_0_SHIPTOSTATE=CA&PAYMENTREQUEST_0_SHIPTOZIP=95131&PAYMENTREQUEST_0_SHIPTOCOUNTRYCODE=US&PAYMENTREQUEST_0_SHIPTOCOUNTRYNAME=United%20States&PAYMENTREQUEST_0_ADDRESSSTATUS=Confirmed&PAYMENTREQUESTINFO_0_ERRORCODE=0
    http_version: 
  recorded_at: Thu, 21 Mar 2013 03:44:37 GMT
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=72.0&TOKEN=EC-66R94860GU0469430&PAYERID=4YLKLC48QZJ6Y&PAYMENTREQUEST_0_DESC=MacBook+Air&PAYMENTREQUEST_0_NOTIFYURL=http%3A%2F%2Fexample.com%2Fpaypal%2Fipn&PAYMENTREQUEST_0_PAYMENTACTION=Authorization&PAYMENTREQUEST_0_AMT=1300.00&PAYMENTREQUEST_0_CURRENCYCODE=USD&method=DoExpressCheckoutPayment
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Thu, 21 Mar 2013 03:44:38 GMT
      Server: 
      - Apache
      Content-Length: 
      - "848"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TOKEN=EC%2d66R94860GU0469430&SUCCESSPAGEREDIRECTREQUESTED=false&TIMESTAMP=2013%2d03%2d21T03%3a44%3a43Z&CORRELATIONID=993e52d255de2&ACK=Success&VERSION=72%2e0&BUILD=5479129&INSURANCEOPTIONSELECTED=false&SHIPPINGOPTIONISDEFAULT=false&PAYMENTINFO_0_TRANSACTIONID=61A03370VS5697915&PAYMENTINFO_0_TRANSACTIONTYPE=expresscheckout&PAYMENTINFO_0_PAYMENTTYPE=instant&PAYMENTINFO_0_ORDERTIME=2013%2d03%2d21T03%3a44%3a42Z&PAYMENTINFO_0_AMT=1300%2e00&PAYMENTINFO_0_TAXAMT=0%2e00&PAYMENTINFO_0_CURRENCYCODE=USD&PAYMENTINFO_0_PAYMENTSTATUS=Pending&PAYMENTINFO_0_PENDINGREASON=authorization&PAYMENTINFO_0_REASONCODE=None&PAYMENTINFO_0_PROTECTIONELIGIBILITY=Eligible&PAYMENTINFO_0_PROTECTIONELIGIBILITYTYPE=ItemNotReceivedEligible%2cUnauthorizedPaymentEligible&PAYMENTINFO_0_SECUREMERCHANTACCOUNTID=GCK9DAQBWTUHQ&PAYMENTINFO_0_ERRORCODE=0&PAYMENTINFO_0_ACK=Success
    http_version: 
  recorded_at: Thu, 21 Mar 2013 03:44:43 GMT
recorded_with: VCR 2.3.0
